test/smp-test/smp-38unit.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AWS Smart Planner Microservices" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <stringProp name="TestPlan.comments">&apos;22년 AWS Public Cloud 전환 프로젝트 단위 성능 테스트</stringProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SMP_HOST" elementType="Argument">
            <stringProp name="Argument.name">SMP_HOST</stringProp>
            <stringProp name="Argument.value">smp.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SMP_PORT" elementType="Argument">
            <stringProp name="Argument.name">SMP_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SMPS_HOST" elementType="Argument">
            <stringProp name="Argument.name">SMPS_HOST</stringProp>
            <stringProp name="Argument.value">smps.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SMPS_PORT" elementType="Argument">
            <stringProp name="Argument.name">SMPS_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMP_HOST" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMP_HOST</stringProp>
            <stringProp name="Argument.value">smpaws.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMP_PORT" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMP_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMPS_HOST" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMPS_HOST</stringProp>
            <stringProp name="Argument.value">smpsaws.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMPS_PORT" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMPS_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Variables pr�-d�finies" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${SMP_HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${SMP_PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept-Encoding</stringProp>
            <stringProp name="Header.value">gzip, deflate, br</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">auth</stringProp>
            <stringProp name="Header.value">skip</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="TS_TOT_02_02" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1966791593">
            <stringProp name="1603">25</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TestPlan.comments">Aurora DB 저장 이벤트 로그 저장 단독</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Gaussian Random Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">300</stringProp>
          <stringProp name="RandomTimer.range">100.0</stringProp>
        </GaussianRandomTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="IMSPJ00038:ZSMPSCOM10010_TR01" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
 &#xd;
    &quot;input1&quot;: [&#xd;
 &#xd;
        {&#xd;
 &#xd;
            &quot;add_info_memo&quot;: &quot;{\&quot;cust_num\&quot;:\&quot;8032666640\&quot;,\&quot;ci\&quot;:\&quot;S3fklrOc7pZlHdls/BxILmf92yHolFh5a4ALcJo16fajcUyc0dLmA0j1cDCzKp+T7qgEnpZWKxgDPuEfDtprRA==\&quot;,\&quot;prod_id\&quot;:\&quot;\&quot;}&quot;,&#xd;
 &#xd;
            &quot;conn_eqp_typ_cd&quot;: &quot;IS&quot;,&#xd;
 &#xd;
            &quot;odm_trms_dtm&quot;: &quot;20220316135959&quot;,&#xd;
 &#xd;
            &quot;qstn_req_ser_num&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;sale_org_id&quot;: &quot;7000000153&quot;,&#xd;
 &#xd;
            &quot;scrn_id&quot;: &quot;ZSMPSCSC10010&quot;,&#xd;
 &#xd;
            &quot;smplnr_strd_grp_id&quot;: &quot;F07&quot;,&#xd;
 &#xd;
            &quot;smplnr_strd_id&quot;: &quot;D1&quot;,&#xd;
 &#xd;
            &quot;sup_sale_org_id&quot;: &quot;C099710000&quot;,&#xd;
 &#xd;
            &quot;svc_mgmt_num&quot;: &quot;1992934216&quot;,&#xd;
 &#xd;
            &quot;svc_num&quot;: &quot;01022080370&quot;,&#xd;
 &#xd;
            &quot;svc_pgm_id&quot;: &quot;SMPSCOM10010T01&quot;,&#xd;
 &#xd;
            &quot;add_eqp_mdl_cd_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;allot_calr_pra_cl_cd&quot;: &quot;03&quot;,&#xd;
 &#xd;
            &quot;allot_calr_use_yn&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;bar_cd_num&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;btv_prod_id_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;card_pay_amt_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;cprod_itm_cd_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;dbm_trms_ser_num&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;eqp_mdl_nm_trms_ctt&quot;: &quot;IPHONE_12_PRO_128GB&quot;,&#xd;
 &#xd;
            &quot;fax_img_num&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;fee_prod_id_trms_ctt&quot;: &quot;NA00006404&quot;,&#xd;
 &#xd;
            &quot;inet_prod_id_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;prom_prod_id_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;req_trms_dtm&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;scrb_typ_cd&quot;: &quot;C1&quot;,&#xd;
 &#xd;
            &quot;simul_id&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;supl_ppln_prod_id_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;wphon_prod_id_trms_ctt&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;flag&quot;: &quot;C&quot;&#xd;
 &#xd;
        }&#xd;
 &#xd;
    ],&#xd;
 &#xd;
    &quot;HEAD&quot;: {&#xd;
 &#xd;
        &quot;Trx_Code&quot;: &quot;ZSMPSCFC00132_TR02&quot;,&#xd;
 &#xd;
        &quot;Ngms_UserId&quot;: &quot;1001036988&quot;,&#xd;
 &#xd;
        &quot;Ngms_LogInId&quot;: &quot;UX168&quot;,&#xd;
 &#xd;
        &quot;Ngms_EmpNum&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_OrgId&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_HrOrgCd&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostOrgCd&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostSaleOrgCd&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_SupSaleOrgCd&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_IpAddr&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_BrTypCd&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_AuthId&quot;: &quot;1&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnOrgId&quot;: &quot;A000700000&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnOrgCd&quot;: &quot;A000700000&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnSaleOrgId&quot;: &quot;A000700000&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnSaleOrgCd&quot;: &quot;A000700000&quot;,&#xd;
 &#xd;
        &quot;Ngms_AuthTypPermCd&quot;: &quot;EQ&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostSaleOrgId&quot;: &quot;A000700000&quot;,&#xd;
 &#xd;
        &quot;Ngms_SupSaleOrgId&quot;: &quot;A010890000&quot;,&#xd;
 &#xd;
        &quot;Term_Type&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;User_Term_Type&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;St_Stop&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;St_Trace&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Stx_Dt&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Stx_Tm&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Etx_Dt&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Etx_Tm&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Rt_Cd&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Screen_Name&quot;: &quot;ZSMPSCFO00010&quot;,&#xd;
 &#xd;
        &quot;Msg_Cnt&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;Handle_Id&quot;: &quot;703744926 &quot;,&#xd;
 &#xd;
        &quot;Ngms_Filler1&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_CoClCd&quot;: &quot;T&quot;,&#xd;
 &#xd;
        &quot;Screen_Call_Trace&quot;: &quot;m:ZSMPSCFO00010-s:ZSMPSCFO00010-ZSMPSCFC00132_TR02&quot;,&#xd;
 &#xd;
        &quot;Pgm_Typ_Cd&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;rowStatus&quot;: &quot;C&quot;&#xd;
 &#xd;
    }&#xd;
 &#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/smtp-smp-evtsvr/api/v1/IMSPJ00038</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">판매상담활용이력저장</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="IMSPJ00038:ZSMPSCOM10020_TR01" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
 &#xd;
    &quot;input1&quot;: [&#xd;
 &#xd;
        {&#xd;
 &#xd;
            &quot;smplnr_strd_grp_id&quot;: &quot;O05&quot;,&#xd;
 &#xd;
            &quot;smplnr_strd_id&quot;: &quot;D6&quot;,&#xd;
 &#xd;
            &quot;svc_num&quot;: &quot;01022080370&quot;,&#xd;
 &#xd;
            &quot;svc_mgmt_num&quot;: &quot;1992934216&quot;,&#xd;
 &#xd;
            &quot;add_info_memo&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;scrn_id&quot;: &quot;ZSMPSCSC10010&quot;,&#xd;
 &#xd;
            &quot;eqp_mdl_cd&quot;: &quot;A3XH&quot;,&#xd;
 &#xd;
            &quot;cvnc_func_memo_ctt&quot;: &quot;NA00006404,NA00007301,,,,,,,,,,,,,,,,,,&quot;,&#xd;
 &#xd;
            &quot;flag&quot;: &quot;C&quot;,&#xd;
 &#xd;
            &quot;audit_id&quot;: &quot;1000964278&quot;,&#xd;
 &#xd;
            &quot;sale_org_id&quot;: &quot;1000009295&quot;,&#xd;
 &#xd;
            &quot;sup_sale_org_id&quot;: &quot;B099920000&quot;,&#xd;
 &#xd;
            &quot;conn_eqp_typ_cd&quot;: &quot;PC&quot;,&#xd;
 &#xd;
            &quot;svc_pgm_id&quot;: &quot;SMPSCOM10020T01&quot;,&#xd;
 &#xd;
            &quot;scrb_typ_cd&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;rowStatus&quot;: &quot;R&quot;&#xd;
 &#xd;
        }&#xd;
 &#xd;
    ],&#xd;
 &#xd;
    &quot;HEAD&quot;: {&#xd;
 &#xd;
        &quot;Trx_Code&quot;: &quot;/smtp-smp-service/api/v1/IMSPJ00038&quot;,&#xd;
 &#xd;
        &quot;Ngms_UserId&quot;: &quot;1000964278&quot;,&#xd;
 &#xd;
        &quot;Ngms_LogInId&quot;: &quot;SCP03&quot;,&#xd;
 &#xd;
        &quot;Ngms_EmpNum&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_OrgId&quot;: &quot;1000009294&quot;,&#xd;
 &#xd;
        &quot;Ngms_HrOrgCd&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostOrgCd&quot;: &quot;D00066A000&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostSaleOrgCd&quot;: &quot;D00066A000&quot;,&#xd;
 &#xd;
        &quot;Ngms_SupSaleOrgCd&quot;: &quot;C099920000&quot;,&#xd;
 &#xd;
        &quot;Ngms_IpAddr&quot;: &quot;150.20.18.205&quot;,&#xd;
 &#xd;
        &quot;Ngms_BrTypCd&quot;: &quot;500&quot;,&#xd;
 &#xd;
        &quot;Ngms_AuthId&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnOrgId&quot;: &quot;1000009295&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnOrgCd&quot;: &quot;D00066&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnSaleOrgId&quot;: &quot;1000009295&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnSaleOrgCd&quot;: &quot;D00066&quot;,&#xd;
 &#xd;
        &quot;Ngms_AuthTypPermCd&quot;: &quot;EQ&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostSaleOrgId&quot;: &quot;1000009294&quot;,&#xd;
 &#xd;
        &quot;Ngms_SupSaleOrgId&quot;: &quot;B099920000&quot;,&#xd;
 &#xd;
        &quot;Term_Type&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;User_Term_Type&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;St_Stop&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;St_Trace&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Stx_Dt&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Stx_Tm&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Etx_Dt&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Etx_Tm&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Rt_Cd&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Screen_Name&quot;: &quot;ZSMPSCSC10010&quot;,&#xd;
 &#xd;
        &quot;Msg_Cnt&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;Handle_Id&quot;: &quot;898660918 &quot;,&#xd;
 &#xd;
        &quot;Ngms_Filler1&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_CoClCd&quot;: &quot;T&quot;,&#xd;
 &#xd;
        &quot;Screen_Call_Trace&quot;: &quot;m:ZSMPSCSC10010-m:ZSMPSCSC10010-/smtp-smp-service/api/v1/IMSPJ00038&quot;,&#xd;
 &#xd;
        &quot;Pgm_Typ_Cd&quot;: &quot;008&quot;,&#xd;
 &#xd;
        &quot;Ngms_TbAgentInfo&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_TbAuthInfo&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;rowStatus&quot;: &quot;C&quot;&#xd;
 &#xd;
    }&#xd;
 &#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/smtp-smp-evtsvr/api/v1/IMSPJ00038</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">추천상품활용이력저장</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="IMSPJ00038:ZSMPSCOM10030_TR01" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
 &#xd;
    &quot;input1&quot;: [&#xd;
 &#xd;
        {&#xd;
 &#xd;
            &quot;smplnr_strd_grp_id&quot;: &quot;DT&quot;,&#xd;
 &#xd;
            &quot;smplnr_strd_id&quot;: &quot;00&quot;,&#xd;
 &#xd;
            &quot;svc_num&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;svc_mgmt_num&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;add_info_memo&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;scrn_id&quot;: &quot;ZSMPSCOM11010&quot;,&#xd;
 &#xd;
            &quot;cntnts_ser_num&quot;: &quot;1650522396394&quot;,&#xd;
 &#xd;
            &quot;cntnts_tit_nm&quot;: &quot;갤럭시 퀀텀3&quot;,&#xd;
 &#xd;
            &quot;cntnts_typ_cd&quot;: &quot;EQP&quot;,&#xd;
 &#xd;
            &quot;prod_cd&quot;: &quot;A3XH&quot;,&#xd;
 &#xd;
            &quot;prod_nm&quot;: &quot;SM-M536S&quot;,&#xd;
 &#xd;
            &quot;flag&quot;: &quot;C&quot;,&#xd;
 &#xd;
            &quot;audit_id&quot;: &quot;1000964278&quot;,&#xd;
 &#xd;
            &quot;sale_org_id&quot;: &quot;1000009295&quot;,&#xd;
 &#xd;
            &quot;sup_sale_org_id&quot;: &quot;B099920000&quot;,&#xd;
 &#xd;
            &quot;conn_eqp_typ_cd&quot;: &quot;PC&quot;,&#xd;
 &#xd;
            &quot;svc_pgm_id&quot;: &quot;SMPSCOM10030T01&quot;,&#xd;
 &#xd;
            &quot;scrb_typ_cd&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;mac_addr&quot;: &quot;&quot;,&#xd;
 &#xd;
            &quot;rowStatus&quot;: &quot;R&quot;&#xd;
 &#xd;
        }&#xd;
 &#xd;
    ],&#xd;
 &#xd;
    &quot;HEAD&quot;: {&#xd;
 &#xd;
        &quot;Trx_Code&quot;: &quot;/smtp-smp-service/api/v1/IMSPJ00038&quot;,&#xd;
 &#xd;
        &quot;Ngms_UserId&quot;: &quot;1000964278&quot;,&#xd;
 &#xd;
        &quot;Ngms_LogInId&quot;: &quot;SCP03&quot;,&#xd;
 &#xd;
        &quot;Ngms_EmpNum&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_OrgId&quot;: &quot;1000009294&quot;,&#xd;
 &#xd;
        &quot;Ngms_HrOrgCd&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostOrgCd&quot;: &quot;D00066A000&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostSaleOrgCd&quot;: &quot;D00066A000&quot;,&#xd;
 &#xd;
        &quot;Ngms_SupSaleOrgCd&quot;: &quot;C099920000&quot;,&#xd;
 &#xd;
        &quot;Ngms_IpAddr&quot;: &quot;150.20.18.205&quot;,&#xd;
 &#xd;
        &quot;Ngms_BrTypCd&quot;: &quot;500&quot;,&#xd;
 &#xd;
        &quot;Ngms_AuthId&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnOrgId&quot;: &quot;1000009295&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnOrgCd&quot;: &quot;D00066&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnSaleOrgId&quot;: &quot;1000009295&quot;,&#xd;
 &#xd;
        &quot;Ngms_ConnSaleOrgCd&quot;: &quot;D00066&quot;,&#xd;
 &#xd;
        &quot;Ngms_AuthTypPermCd&quot;: &quot;EQ&quot;,&#xd;
 &#xd;
        &quot;Ngms_PostSaleOrgId&quot;: &quot;1000009294&quot;,&#xd;
 &#xd;
        &quot;Ngms_SupSaleOrgId&quot;: &quot;B099920000&quot;,&#xd;
 &#xd;
        &quot;Term_Type&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;User_Term_Type&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;St_Stop&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;St_Trace&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Stx_Dt&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Stx_Tm&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Etx_Dt&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Etx_Tm&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Rt_Cd&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Screen_Name&quot;: &quot;ZSMPSCSC10010&quot;,&#xd;
 &#xd;
        &quot;Msg_Cnt&quot;: &quot;0&quot;,&#xd;
 &#xd;
        &quot;Handle_Id&quot;: &quot;898660918 &quot;,&#xd;
 &#xd;
        &quot;Ngms_Filler1&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_CoClCd&quot;: &quot;T&quot;,&#xd;
 &#xd;
        &quot;Screen_Call_Trace&quot;: &quot;m:ZSMPSCSC10010-m:ZSMPSCSC10010-/smtp-smp-service/api/v1/IMSPJ00038&quot;,&#xd;
 &#xd;
        &quot;Pgm_Typ_Cd&quot;: &quot;008&quot;,&#xd;
 &#xd;
        &quot;Ngms_TbAgentInfo&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;Ngms_TbAuthInfo&quot;: &quot;&quot;,&#xd;
 &#xd;
        &quot;rowStatus&quot;: &quot;C&quot;&#xd;
 &#xd;
    }&#xd;
 &#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/smtp-smp-evtsvr/api/v1/IMSPJ00038</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">상담컨텐츠활용이력저장</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>