test/smp-test/smp-top10-2/statistics.json
{
  "IMSPJ00008:ZSMPSCFC00010_TR01" : {
    "transaction" : "IMSPJ00008:ZSMPSCFC00010_TR01",
    "sampleCount" : 5708,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.511562718990817,
    "medianResTime" : 23.0,
    "minResTime" : 17.0,
    "maxResTime" : 55.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 35.0,
    "throughput" : 18.00273131838152,
    "receivedKBytesPerSec" : 61.57060810864087,
    "sentKBytesPerSec" : 33.333182206690786
  },
  "IMSPJ00031:ZSMPSCCD00010_TR01" : {
    "transaction" : "IMSPJ00031:ZSMPSCCD00010_TR01",
    "sampleCount" : 5679,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 52.04719140693795,
    "medianResTime" : 52.0,
    "minResTime" : 37.0,
    "maxResTime" : 259.0,
    "pct1ResTime" : 58.0,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 70.0,
    "throughput" : 17.961117454132573,
    "receivedKBytesPerSec" : 606.5983494922244,
    "sentKBytesPerSec" : 33.41399292004156
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 56879,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.325322175143555,
    "medianResTime" : 23.0,
    "minResTime" : 11.0,
    "maxResTime" : 510.0,
    "pct1ResTime" : 51.0,
    "pct2ResTime" : 53.0,
    "pct3ResTime" : 61.0,
    "throughput" : 178.3096648797768,
    "receivedKBytesPerSec" : 1034.0507374104595,
    "sentKBytesPerSec" : 385.743075311922
  },
  "IMSPJ00024:ZSMPSCOM01010_TR01" : {
    "transaction" : "IMSPJ00024:ZSMPSCOM01010_TR01",
    "sampleCount" : 5689,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.399542977676232,
    "medianResTime" : 15.0,
    "minResTime" : 11.0,
    "maxResTime" : 229.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 24.0,
    "throughput" : 17.95141222614551,
    "receivedKBytesPerSec" : 20.160314380456974,
    "sentKBytesPerSec" : 33.4134684599935
  },
  "IMSPJ00010:ZSMPSCFC00110_TR01" : {
    "transaction" : "IMSPJ00010:ZSMPSCFC00110_TR01",
    "sampleCount" : 5669,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.60363379784793,
    "medianResTime" : 15.0,
    "minResTime" : 11.0,
    "maxResTime" : 228.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 24.300000000000182,
    "throughput" : 17.968532089154856,
    "receivedKBytesPerSec" : 46.34503711021693,
    "sentKBytesPerSec" : 34.63855697655438
  },
  "IMSPJ00034:ZSMPSCOM00042_TR02" : {
    "transaction" : "IMSPJ00034:ZSMPSCOM00042_TR02",
    "sampleCount" : 5666,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.720261207200796,
    "medianResTime" : 25.0,
    "minResTime" : 17.0,
    "maxResTime" : 164.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 46.32999999999993,
    "throughput" : 17.961755978798408,
    "receivedKBytesPerSec" : 22.154007950597247,
    "sentKBytesPerSec" : 41.676886919555685
  },
  "IMSPJ00011:ZSMPSCFC00010_TR05" : {
    "transaction" : "IMSPJ00011:ZSMPSCFC00010_TR05",
    "sampleCount" : 5699,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.636251974030568,
    "medianResTime" : 26.0,
    "minResTime" : 21.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 35.0,
    "throughput" : 17.971625077654195,
    "receivedKBytesPerSec" : 32.46869910102456,
    "sentKBytesPerSec" : 34.90777566352949
  },
  "IMSPJ00009:ZSMPSCFC00010_TR04" : {
    "transaction" : "IMSPJ00009:ZSMPSCFC00010_TR04",
    "sampleCount" : 5693,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.479887581240126,
    "medianResTime" : 15.0,
    "minResTime" : 11.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 24.0,
    "throughput" : 17.959897029503065,
    "receivedKBytesPerSec" : 21.993895245895693,
    "sentKBytesPerSec" : 34.428982293861836
  },
  "IMSPJ00038:ZSMPSCOM10010_TR01" : {
    "transaction" : "IMSPJ00038:ZSMPSCOM10010_TR01",
    "sampleCount" : 5715,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.25529308836393,
    "medianResTime" : 24.0,
    "minResTime" : 17.0,
    "maxResTime" : 510.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 40.0,
    "throughput" : 17.915922129220352,
    "receivedKBytesPerSec" : 22.29198382982225,
    "sentKBytesPerSec" : 54.01020665322581
  },
  "IMSPJ00003:ZSMPSCFC00100_TR02" : {
    "transaction" : "IMSPJ00003:ZSMPSCFC00100_TR02",
    "sampleCount" : 5702,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.129603647842817,
    "medianResTime" : 21.0,
    "minResTime" : 17.0,
    "maxResTime" : 230.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 36.0,
    "throughput" : 17.97887434967681,
    "receivedKBytesPerSec" : 111.96895199432446,
    "sentKBytesPerSec" : 38.292895465473755
  },
  "IMSPJ00040" : {
    "transaction" : "IMSPJ00040",
    "sampleCount" : 5659,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.63756847499552,
    "medianResTime" : 51.0,
    "minResTime" : 43.0,
    "maxResTime" : 86.0,
    "pct1ResTime" : 54.0,
    "pct2ResTime" : 57.0,
    "pct3ResTime" : 70.0,
    "throughput" : 17.934391628293174,
    "receivedKBytesPerSec" : 97.11982599120077,
    "sentKBytesPerSec" : 50.370420237276534
  }
}