test/smp-test/smp-top10-3/statistics.json
{
  "IMSPJ00008:ZSMPSCFC00010_TR01" : {
    "transaction" : "IMSPJ00008:ZSMPSCFC00010_TR01",
    "sampleCount" : 9475,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.77625329815303,
    "medianResTime" : 24.0,
    "minResTime" : 17.0,
    "maxResTime" : 234.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 39.0,
    "throughput" : 29.81106548995548,
    "receivedKBytesPerSec" : 101.95483333529977,
    "sentKBytesPerSec" : 55.197050946245696
  },
  "IMSPJ00031:ZSMPSCCD00010_TR01" : {
    "transaction" : "IMSPJ00031:ZSMPSCCD00010_TR01",
    "sampleCount" : 9425,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 54.79596816976124,
    "medianResTime" : 54.0,
    "minResTime" : 38.0,
    "maxResTime" : 270.0,
    "pct1ResTime" : 62.0,
    "pct2ResTime" : 66.0,
    "pct3ResTime" : 74.0,
    "throughput" : 29.7604951135951,
    "receivedKBytesPerSec" : 1005.0767527954736,
    "sentKBytesPerSec" : 55.36498358535026
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 94425,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.33771776542236,
    "medianResTime" : 24.0,
    "minResTime" : 11.0,
    "maxResTime" : 649.0,
    "pct1ResTime" : 53.0,
    "pct2ResTime" : 57.0,
    "pct3ResTime" : 65.0,
    "throughput" : 295.75559014868435,
    "receivedKBytesPerSec" : 1715.0308270830137,
    "sentKBytesPerSec" : 639.8596788209398
  },
  "IMSPJ00024:ZSMPSCOM01010_TR01" : {
    "transaction" : "IMSPJ00024:ZSMPSCOM01010_TR01",
    "sampleCount" : 9433,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.09000318032439,
    "medianResTime" : 16.0,
    "minResTime" : 11.0,
    "maxResTime" : 62.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 27.0,
    "throughput" : 29.7993997788659,
    "receivedKBytesPerSec" : 33.46619992398515,
    "sentKBytesPerSec" : 55.466460916521875
  },
  "IMSPJ00010:ZSMPSCFC00110_TR01" : {
    "transaction" : "IMSPJ00010:ZSMPSCFC00110_TR01",
    "sampleCount" : 9417,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.26802591058725,
    "medianResTime" : 16.0,
    "minResTime" : 11.0,
    "maxResTime" : 55.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 28.0,
    "throughput" : 29.809028492201914,
    "receivedKBytesPerSec" : 76.88360012788412,
    "sentKBytesPerSec" : 57.46388890977206
  },
  "IMSPJ00034:ZSMPSCOM00042_TR02" : {
    "transaction" : "IMSPJ00034:ZSMPSCOM00042_TR02",
    "sampleCount" : 9408,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.825786564625787,
    "medianResTime" : 26.0,
    "minResTime" : 18.0,
    "maxResTime" : 117.0,
    "pct1ResTime" : 31.0,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 49.0,
    "throughput" : 29.752850207934724,
    "receivedKBytesPerSec" : 36.69715292986354,
    "sentKBytesPerSec" : 69.03591024809855
  },
  "IMSPJ00011:ZSMPSCFC00010_TR05" : {
    "transaction" : "IMSPJ00011:ZSMPSCFC00010_TR05",
    "sampleCount" : 9457,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.44697049804376,
    "medianResTime" : 27.0,
    "minResTime" : 21.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 40.0,
    "throughput" : 29.780855479242835,
    "receivedKBytesPerSec" : 53.80412137895092,
    "sentKBytesPerSec" : 57.84582182442773
  },
  "IMSPJ00009:ZSMPSCFC00010_TR04" : {
    "transaction" : "IMSPJ00009:ZSMPSCFC00010_TR04",
    "sampleCount" : 9447,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.295755266222077,
    "medianResTime" : 16.0,
    "minResTime" : 11.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 29.0,
    "throughput" : 29.73831416780254,
    "receivedKBytesPerSec" : 36.41787673508913,
    "sentKBytesPerSec" : 57.00811592909803
  },
  "IMSPJ00038:ZSMPSCOM10010_TR01" : {
    "transaction" : "IMSPJ00038:ZSMPSCOM10010_TR01",
    "sampleCount" : 9490,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.595363540569025,
    "medianResTime" : 24.0,
    "minResTime" : 17.0,
    "maxResTime" : 649.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 44.0,
    "throughput" : 29.810613080859326,
    "receivedKBytesPerSec" : 37.09222687871258,
    "sentKBytesPerSec" : 89.86851814512961
  },
  "IMSPJ00003:ZSMPSCFC00100_TR02" : {
    "transaction" : "IMSPJ00003:ZSMPSCFC00100_TR02",
    "sampleCount" : 9469,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.714647798077962,
    "medianResTime" : 22.0,
    "minResTime" : 16.0,
    "maxResTime" : 55.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 38.0,
    "throughput" : 29.766526567937404,
    "receivedKBytesPerSec" : 185.38040665699495,
    "sentKBytesPerSec" : 63.399213324874495
  },
  "IMSPJ00040" : {
    "transaction" : "IMSPJ00040",
    "sampleCount" : 9404,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 52.71533390046778,
    "medianResTime" : 52.0,
    "minResTime" : 42.0,
    "maxResTime" : 269.0,
    "pct1ResTime" : 57.0,
    "pct2ResTime" : 63.0,
    "pct3ResTime" : 73.0,
    "throughput" : 29.82934720548119,
    "receivedKBytesPerSec" : 161.53472220845492,
    "sentKBytesPerSec" : 83.77851812789444
  }
}