test/smp-test/top10/smp-top10-300th-2/statistics.json
{
  "IMSPJ00008:ZSMPSCFC00010_TR01" : {
    "transaction" : "IMSPJ00008:ZSMPSCFC00010_TR01",
    "sampleCount" : 27124,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 50.578970653296146,
    "medianResTime" : 45.0,
    "minResTime" : 20.0,
    "maxResTime" : 369.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 94.0,
    "pct3ResTime" : 128.0,
    "throughput" : 80.26324355355125,
    "receivedKBytesPerSec" : 274.503526834989,
    "sentKBytesPerSec" : 148.61241189212222
  },
  "IMSPJ00031:ZSMPSCCD00010_TR01" : {
    "transaction" : "IMSPJ00031:ZSMPSCCD00010_TR01",
    "sampleCount" : 26966,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 96.11180746124698,
    "medianResTime" : 88.0,
    "minResTime" : 41.0,
    "maxResTime" : 1128.0,
    "pct1ResTime" : 134.0,
    "pct2ResTime" : 151.0,
    "pct3ResTime" : 190.0,
    "throughput" : 80.0938576690032,
    "receivedKBytesPerSec" : 2704.73668199403,
    "sentKBytesPerSec" : 149.00273326118273
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 270186,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 54.95140754887344,
    "medianResTime" : 39.0,
    "minResTime" : 13.0,
    "maxResTime" : 1128.0,
    "pct1ResTime" : 82.0,
    "pct2ResTime" : 98.0,
    "pct3ResTime" : 132.0,
    "throughput" : 795.8889703868008,
    "receivedKBytesPerSec" : 4614.701104106464,
    "sentKBytesPerSec" : 1721.8291275071656
  },
  "IMSPJ00024:ZSMPSCOM01010_TR01" : {
    "transaction" : "IMSPJ00024:ZSMPSCOM01010_TR01",
    "sampleCount" : 26996,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 39.592458141946864,
    "medianResTime" : 33.0,
    "minResTime" : 14.0,
    "maxResTime" : 1063.0,
    "pct1ResTime" : 68.0,
    "pct2ResTime" : 81.0,
    "pct3ResTime" : 113.0,
    "throughput" : 80.12513244866038,
    "receivedKBytesPerSec" : 89.9856650759224,
    "sentKBytesPerSec" : 149.1391625460417
  },
  "IMSPJ00010:ZSMPSCFC00110_TR01" : {
    "transaction" : "IMSPJ00010:ZSMPSCFC00110_TR01",
    "sampleCount" : 26938,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 39.91859083822142,
    "medianResTime" : 34.0,
    "minResTime" : 13.0,
    "maxResTime" : 306.0,
    "pct1ResTime" : 69.0,
    "pct2ResTime" : 82.0,
    "pct3ResTime" : 114.0,
    "throughput" : 79.9995248376281,
    "receivedKBytesPerSec" : 206.33483144821327,
    "sentKBytesPerSec" : 154.21783401316202
  },
  "IMSPJ00034:ZSMPSCOM00042_TR02" : {
    "transaction" : "IMSPJ00034:ZSMPSCOM00042_TR02",
    "sampleCount" : 26911,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 53.36334584370672,
    "medianResTime" : 47.0,
    "minResTime" : 20.0,
    "maxResTime" : 317.0,
    "pct1ResTime" : 84.0,
    "pct2ResTime" : 98.0,
    "pct3ResTime" : 132.0,
    "throughput" : 80.05366460218585,
    "receivedKBytesPerSec" : 98.74120227468454,
    "sentKBytesPerSec" : 185.74951864725938
  },
  "IMSPJ00011:ZSMPSCFC00010_TR05" : {
    "transaction" : "IMSPJ00011:ZSMPSCFC00010_TR05",
    "sampleCount" : 27069,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.49525287228947,
    "medianResTime" : 46.0,
    "minResTime" : 24.0,
    "maxResTime" : 336.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 93.0,
    "pct3ResTime" : 125.0,
    "throughput" : 80.11281911650676,
    "receivedKBytesPerSec" : 144.73771236360042,
    "sentKBytesPerSec" : 155.60976291282412
  },
  "IMSPJ00009:ZSMPSCFC00010_TR04" : {
    "transaction" : "IMSPJ00009:ZSMPSCFC00010_TR04",
    "sampleCount" : 27036,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 39.88189820979423,
    "medianResTime" : 34.0,
    "minResTime" : 14.0,
    "maxResTime" : 1057.0,
    "pct1ResTime" : 68.0,
    "pct2ResTime" : 81.0,
    "pct3ResTime" : 113.0,
    "throughput" : 80.04452839573428,
    "receivedKBytesPerSec" : 98.02452892125224,
    "sentKBytesPerSec" : 153.4447355867445
  },
  "IMSPJ00038:ZSMPSCOM10010_TR01" : {
    "transaction" : "IMSPJ00038:ZSMPSCOM10010_TR01",
    "sampleCount" : 27157,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 48.32290017306749,
    "medianResTime" : 40.0,
    "minResTime" : 21.0,
    "maxResTime" : 1044.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 90.0,
    "pct3ResTime" : 123.0,
    "throughput" : 80.18010038382049,
    "receivedKBytesPerSec" : 99.76658801114556,
    "sentKBytesPerSec" : 241.7148143406776
  },
  "IMSPJ00003:ZSMPSCFC00100_TR02" : {
    "transaction" : "IMSPJ00003:ZSMPSCFC00100_TR02",
    "sampleCount" : 27102,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.19020736476969,
    "medianResTime" : 45.0,
    "minResTime" : 20.0,
    "maxResTime" : 315.0,
    "pct1ResTime" : 82.0,
    "pct2ResTime" : 97.0,
    "pct3ResTime" : 133.0,
    "throughput" : 80.13222319464485,
    "receivedKBytesPerSec" : 499.05557418373166,
    "sentKBytesPerSec" : 170.6722449096879
  },
  "IMSPJ00040" : {
    "transaction" : "IMSPJ00040",
    "sampleCount" : 26887,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.27199018112768,
    "medianResTime" : 73.0,
    "minResTime" : 46.0,
    "maxResTime" : 345.0,
    "pct1ResTime" : 109.0,
    "pct2ResTime" : 122.0,
    "pct3ResTime" : 155.0,
    "throughput" : 80.19458827459495,
    "receivedKBytesPerSec" : 434.2917024274321,
    "sentKBytesPerSec" : 225.23401941185068
  }
}